app/views/shared/_mark_to_market.html.erb

<%
  @trade = Trade.find(2)
  tenor_end = @trade[:tenor_end].upcase().gsub(/[-]/, " ")
  @price_nymex = PricesNymex.where(:date, "#{tenor_end}")
---
SELECT "trades".* FROM "trades" WHERE "trades"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "prices_nymex".* FROM "prices_nymex" WHERE "prices_nymex"."date" = 'APR 13'