app/controllers/curves_controller.rb

SELECT "curves".* FROM "curves"
---
  def index
    @curves = Curve.all