app/controllers/trades_controller.rb

  def index
  	@trades = Trade.all
---
SELECT "trades".* FROM "trades"

  def show
  	@trade = Trade.find(params[:id])
  	@trades = Trade.all
    @price = Price.where('curve_id = ? AND month_id = ?', @trade.curve_id, @trade.month_id).all
---
SELECT "trades".* FROM "trades" WHERE "trades"."id" = ? LIMIT 1  [["id", "index"]]
SELECT "trades".* FROM "trades"
SELECT "prices".* FROM "prices" WHERE "prices"."id" = ? AND (curve_id = 3 AND month_id = 7) LIMIT 1  [["id", :settle]]