app/views/trades/index.html.erb

    <% market_price = 0 %>
    <% price_record = Price.where('curve_id = ? AND month_id = ?', trade.curve_id, trade.month_id).all %>
---
SELECT "prices".* FROM "prices" WHERE (curve_id = 3 AND month_id = 7)

        <div class="row-fluid">
          <div class="span9"><p class="text-left"><%= "#{trade.trader} entered this #{trade.instrument} trade   with counterparty #{trade.counterparty}. #{trade.notes}, used brokerage #{trade.brokerage}, price curve from #{trade.mtm_curve}" %></p></div>
---
SELECT "trades".* FROM "trades"